import React from "react";
import Header from "../components/Header";
import Footer from "../components/Footer";
import "./MyPage.css";
import { useNavigate } from "react-router-dom";

export default function MyPage() {

    const navigate = useNavigate();
    // 추후 실제 데이터 연동 자리 (예: API, Context)
    const user = {
        name: "김도현",
        point: 0,
        deposit: 0,
        coupons: 1,
        couponNote: "(퀴즈성공 쿠폰)",
    };

    return (
        <>
            <Header />

            <div className="container">
                {/* 상단 메뉴 */}
                <div id="top-menu">
                    <h1>마이페이지</h1>
                    <div id="top-menu-icons">
                        <i class="fa-solid fa-bell"></i>

                        <i class="fa-solid fa-gear"></i>


                    </div>
                </div>

                {/* 유저 정보 */}
                <div id="user-info">
                    <div className="profile">
                        <div className="avatar" aria-hidden="true" />
                        <div className="name">
                            <span>{user.name} 님</span>
                            <button type="button" onClick={() => navigate("/mypageEdit")}> 회원정보 변경 </button>
                        </div>
                    </div>

                    <div id="profile-balance">
                        <div className="item">
                            <span className="icon" aria-hidden="true">
                                {/* 적립금 아이콘 (SVG) */}
                                <svg
                                    width="75"
                                    height="75"
                                    viewBox="0 0 75 75"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        fillRule="evenodd"
                                        clipRule="evenodd"
                                        d="M53.9062 65.625C65.5781 65.625 75 60.9375 75 53.9062V9.375C75 4.6875 65.625 0 53.9062 0C42.1875 0 32.8125 4.6875 32.8125 9.375V25.7812C38.2969 28.0781 42.9844 31.9219 46.3125 36.7969C48.6094 37.2469 51.1406 37.4953 53.9062 37.4953C60.0469 37.4953 65.1562 36.2719 68.8125 34.2797C69.3316 33.9944 69.8368 33.6847 70.3266 33.3516V39.8203C70.3266 40.9219 69.45 42.6328 66.5672 44.2078C63.7734 45.7312 59.4891 46.8516 53.9109 46.8516C52.7953 46.8516 51.7328 46.8094 50.7234 46.725C51.0984 48.2656 51.3484 49.8438 51.4734 51.4594C52.2641 51.5031 53.0766 51.525 53.9109 51.525C60.0516 51.525 65.1609 50.3016 68.8172 48.3094C69.3363 48.0241 69.8415 47.7144 70.3312 47.3812V53.85C70.3312 54.9562 69.6328 56.5969 66.6234 58.2188C63.6609 59.8125 59.2172 60.8812 53.9203 60.8812C52.8422 60.8812 51.7984 60.8375 50.7891 60.75C50.4287 62.308 49.9444 63.8348 49.3406 65.3156C50.8156 65.4812 52.3406 65.5641 53.9156 65.5641L53.9062 65.625ZM66.5625 30.1875C69.4453 28.6125 70.3219 26.9016 70.3219 25.8V19.3313C69.8375 19.6625 69.3328 19.9719 68.8078 20.2594C65.1609 22.2516 60.0422 23.475 53.9016 23.475C47.7609 23.475 42.6516 22.2516 38.9953 20.2594C38.4763 19.9741 37.971 19.6644 37.4812 19.3313V25.8C37.4812 26.9016 38.3578 28.6125 41.2406 30.1828C44.0344 31.7063 48.3188 32.8266 53.8969 32.8266C59.475 32.8266 63.7406 31.7063 66.5531 30.1828L66.5625 30.1875ZM37.5 11.7188C37.5 10.3687 38.0859 9.07031 39.1781 8.27812C39.7734 7.84688 40.4203 7.41562 40.9313 7.18125C42.2109 6.59062 48.6187 4.68281 53.9156 4.68281C59.2125 4.68281 63.8063 5.74687 66.9 7.18125C67.4813 7.44844 68.1234 7.86563 68.6906 8.27812C69.7734 9.06094 70.3312 10.35 70.3312 11.6859V11.7141C70.3312 12.8156 69.4547 14.5266 66.5719 16.1016C63.7781 17.625 59.4937 18.7453 53.9156 18.7453C48.3375 18.7453 44.0719 17.6203 41.2594 16.1016C38.3766 14.5312 37.5 12.8156 37.5 11.7188Z"
                                        fill="#757575"
                                    />
                                    <path
                                        fillRule="evenodd"
                                        clipRule="evenodd"
                                        d="M42.1875 53.9062C42.1875 65.5781 32.7656 75 21.0938 75C9.42188 75 0 65.5781 0 53.9062C0 42.2344 9.42188 32.8125 21.0938 32.8125C32.7656 32.8125 42.1875 42.2344 42.1875 53.9062ZM37.5 53.9062C37.5 62.9531 30.1406 70.3125 21.0938 70.3125C12.0469 70.3125 4.6875 62.9531 4.6875 53.9062C4.6875 44.8594 12.0469 37.5 21.0938 37.5C30.1406 37.5 37.5 44.8594 37.5 53.9062Z"
                                        fill="#757575"
                                    />
                                </svg>
                            </span>
                            <div>
                                <p>적립금</p>
                                <strong>{user.point.toLocaleString()}원</strong>
                            </div>
                        </div>

                        <div className="item">
                            <span className="icon" aria-hidden="true">
                                {/* 예치금 아이콘 (SVG) */}
                                <svg
                                    width="77"
                                    height="77"
                                    viewBox="0 0 77 77"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M50.6714 34.4458V34.4864M10.8196 23.8126C9.04096 22.4455 7.6749 20.6132 6.87242 18.5183C6.06994 16.4234 5.8623 14.1474 6.27245 11.9419C6.6826 9.73632 7.69457 7.68712 9.1965 6.02076C10.6984 4.3544 12.6319 3.13576 14.7831 2.49953C16.9343 1.8633 19.2195 1.83426 21.3862 2.41562C23.5529 2.99698 25.5166 4.1661 27.0604 5.79377C28.6042 7.42143 29.6679 9.44425 30.134 11.6387C30.6 13.8331 30.4503 16.1136 29.7013 18.2282"
                                        stroke="#757575"
                                        strokeWidth="4"
                                        strokeLinecap="round"
                                        strokeLinejoin="round"
                                    />
                                    <path
                                        d="M54.7274 6.05801V21.4807C59.7461 24.3852 63.5671 28.9812 65.5065 34.4459H70.9447C72.0202 34.4459 73.0517 34.8732 73.8122 35.6337C74.5727 36.3942 75 37.4257 75 38.5013V46.6121C75 47.6877 74.5727 48.7192 73.8122 49.4797C73.0517 50.2403 72.0202 50.6675 70.9447 50.6675H65.5024C64.1398 54.5202 61.8242 57.9673 58.7786 60.6966V68.9169C58.7786 70.5302 58.1378 72.0775 56.997 73.2183C55.8562 74.3591 54.309 75 52.6956 75C51.0823 75 49.5351 74.3591 48.3943 73.2183C47.2535 72.0775 46.6126 70.5302 46.6126 68.9169V66.5526C45.2726 66.7778 43.9161 66.8904 42.5573 66.8892H26.3359C24.9771 66.8904 23.6206 66.7778 22.2806 66.5526V68.9169C22.2806 70.5302 21.6397 72.0775 20.4989 73.2183C19.3582 74.3591 17.8109 75 16.1976 75C14.5843 75 13.0371 74.3591 11.8963 73.2183C10.7555 72.0775 10.1146 70.5302 10.1146 68.9169V60.6966C6.44031 57.4115 3.85022 53.0881 2.68718 48.2986C1.52413 43.5091 1.84297 38.4793 3.60149 33.875C5.36 29.2707 8.47528 25.3089 12.535 22.5142C16.5947 19.7194 21.4073 18.2234 26.3359 18.2242H36.4743L54.7274 6.05801Z"
                                        stroke="#757575"
                                        strokeWidth="4"
                                        strokeLinecap="round"
                                        strokeLinejoin="round"
                                    />
                                </svg>
                            </span>
                            <div>
                                <p>예치금</p>
                                <strong>{user.deposit.toLocaleString()}원</strong>
                            </div>
                        </div>

                        <div className="item">
                            <span className="icon" aria-hidden="true">
                                {/* 쿠폰 아이콘 (SVG) */}
                                <svg
                                    width="68"
                                    height="48"
                                    viewBox="0 0 68 48"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M24.1538 0V12M24.1538 16.8V33.6M24.1538 38.4V48M2 45.6H66V33.6C63.5385 32.7984 58.6154 29.76 58.6154 24C58.6154 16.8 66 16.8 66 14.4V2.4H2V14.4C4.46154 15.2016 9.38462 18.24 9.38462 24C9.38462 31.2 2 31.2 2 33.6V45.6Z"
                                        stroke="#757575"
                                        strokeWidth="4"
                                        strokeLinejoin="round"
                                    />
                                </svg>
                            </span>
                            <div>
                                <p>쿠폰</p>
                                <strong>{user.coupons}개</strong>
                                <small>{user.couponNote}</small>
                            </div>
                        </div>
                    </div>
                </div>

                {/* 하단 메뉴 */}
                <div className="bottom-menu">
                    <div id="left-menu">
                        <div>주문 내역 <i className="fa-solid fa-chevron-right" /></div>
                        <div>취소/반품/교환 내역 <i className="fa-solid fa-chevron-right" /></div>
                        <div>환불/입금 내역 <i className="fa-solid fa-chevron-right" /></div>
                        <div>장바구니 <i className="fa-solid fa-chevron-right" /></div>
                    </div>
                    <div id="right-menu">
                        <div>재입고 알림 <i className="fa-solid fa-chevron-right" /></div>
                        <div>최근 본 상품 <i className="fa-solid fa-chevron-right" /></div>
                        <div>배송지 관리 <i className="fa-solid fa-chevron-right" /></div>
                        <div>나의 리뷰 <i className="fa-solid fa-chevron-right" /></div>
                    </div>
                </div>
            </div>

            <Footer />
        </>
    );
}
